albert-gee/matter_mq_air_quality/sdkconfig.defaults.esp32h2
CONFIG_IDF_TARGET="esp32h2"

CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y

# Enable OpenThread for the ESP32-H2 MQ air quality sensor
CONFIG_OPENTHREAD_ENABLED=y
CONFIG_OPENTHREAD_SRP_CLIENT=y
CONFIG_OPENTHREAD_LOG_LEVEL_DYNAMIC=n
CONFIG_OPENTHREAD_LOG_LEVEL_NOTE=y
CONFIG_OPENTHREAD_CLI=n

# Disable lwIP IPv6 autoconfig; Thread config supplies IPv6 behavior
CONFIG_LWIP_IPV6_AUTOCONFIG=n

# LwIP config for OpenThread
CONFIG_LWIP_IPV6_NUM_ADDRESSES=8
CONFIG_LWIP_MULTICAST_PING=y

# MDNS platform
CONFIG_USE_MINIMAL_MDNS=n

# Disable station mode for ESP32-H2
CONFIG_ENABLE_WIFI_STATION=n
